tap 'neovim/neovim'
#brew 'neovim'

tap 'homebrew/cask-fonts'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-roboto-mono-nerd-font'
cask 'font-inconsolata-nerd-font'

brew 'autojump'

# This is used to managed the encryption of this repo
brew 'git-crypt'

# Trying out a different diff tool
brew 'git-delta'

# Trying to sign my commits now
brew 'gpg'

# Needed for `realpath` used in `locksmith`
brew 'coreutils'

brew 'jq'
brew 'mr'

# alacritty is a single pane terminal so need to use tmux for tabs and panes
brew 'tmux'

brew 'tree'

cask '1password'
cask '1password-cli'

# Experimental
# Terminal is ok for general purpose but I want to experiment with the file based configuration
# of alactritty. Full color support is nice too.
cask 'alacritty', args: { no_quarantine: true }

cask 'brave-browser'
